## Step 1 Data Exploration & Leading

In [36]:
# importing the dependencies
import pandas as pd

# Postgres
import psycopg2 #this will allow us to connect to the postgres database
from sqlalchemy import create_engine

In [6]:
print(pd.__version__)

2.3.1

In [10]:
# Load the Walmart dataset (correct file path)
df = pd.read_csv('../Walmart.csv', encoding_errors='ignore')
print(f"Dataset shape: {df.shape}")
print(f"Columns: {list(df.columns)}")

Dataset shape: (10051, 11)
Columns: ['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity', 'date', 'time', 'payment_method', 'rating', 'profit_margin']

In [11]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [12]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

We can see that quantity is having some missing values

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

in unit price and quantiy there are some missing values

In [ ]:
# Duplicates check
# This will return the number of duplicate rows in the DataFrame
df.duplicated().sum()

np.int64(51)

In [15]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [9]:
# Basic Data Exploration
print("=== DATASET OVERVIEW ===")
print(f"Dataset shape: {df.shape[0]} rows, {df.shape[1]} columns")
print(f"\nData types:")
print(df.dtypes)

print(f"\n=== MISSING VALUES ===")
missing_values = df.isnull().sum()
print(missing_values[missing_values > 0])

print(f"\n=== BASIC STATISTICS ===")
df.describe()

=== DATASET OVERVIEW ===
Dataset shape: 10051 rows, 11 columns

Data types:
invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

=== MISSING VALUES ===
unit_price    31
quantity      31
dtype: int64

=== BASIC STATISTICS ===

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [16]:
df.drop_duplicates(inplace=True)   
df.duplicated().sum()

np.int64(0)

In [17]:
df.shape

(10000, 11)

Here we have removed the duplicates now lets work on removing the nulls

In [18]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [21]:
## Dropping all rows with missing recods
df.dropna(inplace=True)
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

The missing values is Dropped

In [22]:
df.shape

(9969, 11)

In [23]:
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [29]:
df['unit_price'] = df['unit_price'].str.replace('$', '').astype(float)

In [30]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   object
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 934.6+ KB

In [32]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

We are adding a new column

In [33]:
df['total'] = df['unit_price'] * df['quantity']

In [34]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [49]:
##psql
host = 'localhost'
port = '5432'   # default port for PostgreSQL
user = 'postgres'
password = 'Abishek@2000'  # replace with your actual password

In [38]:
df.to_csv('walmart_cleaned.csv', index=False)

In [61]:
df.to_sql

<bound method NDFrame.to_sql of       invoice_id   Branch         City                category  unit_price  \
0              1  WALM003  San Antonio       Health and beauty       74.69
1              2  WALM048    Harlingen  Electronic accessories       15.28
2              3  WALM067  Haltom City      Home and lifestyle       46.33
3              4  WALM064      Bedford       Health and beauty       58.22
4              5  WALM013       Irving       Sports and travel       86.31
...          ...      ...          ...                     ...         ...
9995        9996  WALM056      Rowlett     Fashion accessories       37.00
9996        9997  WALM030   Richardson      Home and lifestyle       58.00
9997        9998  WALM050     Victoria     Fashion accessories       52.00
9998        9999  WALM032        Tyler      Home and lifestyle       79.00
9999       10000  WALM069     Rockwall     Fashion accessories       62.00

      quantity      date      time payment_method  rating  profit_margin  \
0          7.0  05/01/19  13:08:00        Ewallet     9.1           0.48
1          5.0  08/03/19  10:29:00           Cash     9.6           0.48
2          7.0  03/03/19  13:23:00    Credit card     7.4           0.33
3          8.0  27/01/19  20:33:00        Ewallet     8.4           0.33
4          7.0  08/02/19  10:37:00        Ewallet     5.3           0.48
...        ...       ...       ...            ...     ...            ...
9995       3.0  03/08/23  10:10:00           Cash     3.0           0.33
9996       2.0  22/02/21  14:20:00           Cash     7.0           0.48
9997       3.0  15/06/23  16:00:00    Credit card     4.0           0.48
9998       2.0  25/02/21  12:25:00           Cash     7.0           0.48
9999       3.0  26/09/20   9:48:00           Cash     3.0           0.33

       total
0     522.83
1      76.40
2     324.31
3     465.76
4     604.17
...      ...
9995  111.00
9996  116.00
9997  156.00
9998  158.00
9999  186.00

[9969 rows x 12 columns]>

In [62]:
# ‚úÖ WORKING PostgreSQL Connection
from urllib.parse import quote_plus
from sqlalchemy import create_engine, text

# Connection parameters
host = 'localhost'
port = '5432'
user = 'postgres'
password = 'Abishek@2000'

# URL encode password to handle special characters
encoded_password = quote_plus(password)

print("üîß Connecting to PostgreSQL...")

try:
    # Create the connection string
    connection_string = f'postgresql+psycopg2://{user}:{encoded_password}@{host}:{port}/postgres'
    engine_psql = create_engine(connection_string)
    
    # Test the connection
    connection = engine_psql.connect()
    print("‚úÖ PostgreSQL connection successful!")
    
    # Get PostgreSQL version (fixed SQL execution)
    result = connection.execute(text("SELECT version();"))
    version = result.fetchone()[0]
    print(f"üìä PostgreSQL version: {version[:60]}...")
    
    connection.close()
    print("üéØ Ready to load data into PostgreSQL!")
    
except Exception as e:
    print(f"‚ùå Connection failed: {e}")
    print("üí° Solutions:")
    print("   1. Make sure PostgreSQL is running")
    print("   2. Check username/password are correct")
    print("   3. Verify host and port settings")

üîß Connecting to PostgreSQL...
‚úÖ PostgreSQL connection successful!
üìä PostgreSQL version: PostgreSQL 17.5 on x86_64-apple-darwin23.6.0, compiled by Ap...
üéØ Ready to load data into PostgreSQL!

In [67]:
#psql connection
# "mysql+pymysql://user:password@localhost:3306/db_name"
engine_psql = create_engine('postgresql+psycopg2://postgres:Abishek@2000@localhost:5432/walmart_db')

try:
    engine_psql
    print("Connection Successed to PSQL")
except:
    print("Unable to connect")

Connection Successed to PSQL

In [70]:
# ‚úÖ Use the working connection with proper URL encoding
from urllib.parse import quote_plus

# Connection parameters  
host = 'localhost'
port = '5432'
user = 'postgres'
password = 'Abishek@2000'

# URL encode password to handle special characters like @
encoded_password = quote_plus(password)

# Create proper connection string
connection_string = f'postgresql+psycopg2://{user}:{encoded_password}@{host}:{port}/postgres'
engine_psql = create_engine(connection_string)

print("üîÑ Uploading data to PostgreSQL...")
df.to_sql(name='walmart', con=engine_psql, if_exists='replace', index=False)
print(f"‚úÖ Successfully uploaded {len(df)} rows to PostgreSQL!")

üîÑ Uploading data to PostgreSQL...
‚úÖ Successfully uploaded 9969 rows to PostgreSQL!
‚úÖ Successfully uploaded 9969 rows to PostgreSQL!